[
    {
        "character1": "alchemist",
        "character2": "boffin",
        "description": "If the Alchemist has the Boffin ability, the Alchemist does not learn what ability the Demon has."
    },
    {
        "character1": "alchemist",
        "character2": "marionette",
        "description": "An Alchemist-Marionette has no Marionette ability & the Marionette is in play."
    },
    {
        "character1": "alchemist",
        "character2": "mastermind",
        "description": "An Alchemist-Mastermind has no Mastermind ability & the Mastermind is not-in-play."
    },
    {
        "character1": "alchemist",
        "character2": "organ grinder",
        "description": "If the Alchemist has the Organ Grinder ability, the Organ Grinder is in play & if both the Alchemist and Organ Grinder are sober, both are drunk."
    },
    {
        "character1": "alchemist",
        "character2": "spy",
        "description": "If the Alchemist has the Spy ability, they do not, and a Spy is in play. Each day, after the execution phase, the living Alchemist may publicly guess a living player as the Spy. If correct, the Demon must choose the Spy tonight."
    },
    {
        "character1": "alchemist",
        "character2": "summoner",
        "description": "The Alchemist-Summoner does not get bluffs, and chooses which Demon but not which player. If they die before this happens, evil wins. [No Demon]"
    },
    {
        "character1": "alchemist",
        "character2": "wraith",
        "description": "If the Alchemist has the Wraith ability, they do not, and a Wraith is in play. Each day, after the execution phase, the living Alchemist may publicly guess a living player as the Wraith: if correct, the Demon must choose the Wraith tonight."
    },
    {
        "character1": "alchemist",
        "character2": "widow",
        "description": "If the Alchemist has the Widow ability, they do not, and a Widow is in play. Each day, after the execution phase, the living Alchemist may publicly guess a living player as the Widow. If correct, the Demon must choose the Widow tonight."
    },
    {
        "character1": "bounty hunter",
        "character2": "kazali",
        "description": "An evil Townsfolk is only created if the Bounty Hunter is still in play after the Kazali acts."
    },
    {
        "character1": "bounty hunter",
        "character2": "philosopher",
        "description": "If the Philosopher gains the Bounty Hunter ability, a Townsfolk might turn evil."
    },
    {
        "character1": "cannibal",
        "character2": "butler",
        "description": "If the Cannibal gains the Butler ability, the Cannibal learns this."
    },
    {
        "character1": "cannibal",
        "character2": "juggler",
        "description": "If the Juggler guesses on their first day and dies by execution, tonight the living Cannibal learns how many guesses the Juggler got correct."
    },
    {
        "character1": "cannibal",
        "character2": "poppy grower",
        "description": "If the Cannibal eats the Poppy Grower, then dies or loses the Poppy Grower ability, the Demon and Minions learn each other that night."
    },
    {
        "character1": "cannibal",
        "character2": "princess",
        "description": "If the Cannibal nominated, executed, & killed the Princess today, the Demon doesn’t kill tonight."
    },
    {
        "character1": "cannibal",
        "character2": "zealot",
        "description": "If the Cannibal gains the Zealot ability, the Cannibal learns this."
    },
    {
        "character1": "mathematician",
        "character2": "chambermaid",
        "description": "The Chambermaid learns if the Mathematician wakes tonight or not, even though the Chambermaid wakes first."
    },
    {
        "character1": "mathematician",
        "character2": "lunatic",
        "description": "The Mathematician learns if the Lunatic attacks a different player(s) than the real Demon attacked."
    },
    {
        "character1": "magician",
        "character2": "spy",
        "description": "When the Spy sees the Grimoire, the Demon and Magician's character tokens are removed."
    },
    {
        "character1": "magician",
        "character2": "vizier",
        "description": "If the Vizier and Magician are both in play, the Demon does not learn the Minions."
    },
    {
        "character1": "magician",
        "character2": "widow",
        "description": "When the Widow sees the Grimoire, the Demon and Magician's character tokens are removed."
    },
    {
        "character1": "magician",
        "character2": "wraith",
        "description": "Each day, after the execution phase, the living Magician may publicly guess a living player as the Wraith: if correct, the Demon must choose the Wraith tonight."
    },
    {
        "character1": "magician",
        "character2": "lil' monsta",
        "description": "Each night, the Magician chooses a Minion: if that Minion & Lil' Monsta are alive, that Minion babysits Lil’ Monsta."
    },
    {
        "character1": "butler",
        "character2": "organ grinder",
        "description": "If the Organ Grinder is causing eyes closed voting, the Butler may raise their hand to vote but their vote is only counted if their master voted too."
    },
    {
        "character1": "heretic",
        "character2": "baron",
        "description": "The Baron might only add 1 Outsider, not 2."
    },
    {
        "character1": "heretic",
        "character2": "boffin",
        "description": "The Demon cannot have the Heretic ability."
    },
    {
        "character1": "heretic",
        "character2": "godfather",
        "description": "Only 1 jinxed character can be in play."
    },
    {
        "character1": "heretic",
        "character2": "lleech",
        "description": "If the Lleech has poisoned the Heretic then the Lleech dies, the Heretic remains poisoned."
    },
    {
        "character1": "heretic",
        "character2": "pit-hag",
        "description": "A Pit-Hag can not create a Heretic."
    },
    {
        "character1": "heretic",
        "character2": "spy",
        "description": "Only 1 jinxed character can be in play."
    },
    {
        "character1": "heretic",
        "character2": "widow",
        "description": "Only 1 jinxed character can be in play."
    },
    {
        "character1": "ogre",
        "character2": "recluse",
        "description": "If the Recluse registers as evil to the Ogre, the Ogre learns that they are evil."
    },
    {
        "character1": "plague doctor",
        "character2": "baron",
        "description": "If the Storyteller gains the Baron ability, up to two players become not-in-play Outsiders."
    },
    {
        "character1": "plague doctor",
        "character2": "boomdandy",
        "description": "If the Plague Doctor is executed and the Storyteller would gain the Boomdandy ability, the Boomdandy ability triggers immediately."
    },
    {
        "character1": "plague doctor",
        "character2": "evil twin",
        "description": "The Storyteller cannot gain the Evil Twin ability if the Plague Doctor dies."
    },
    {
        "character1": "plague doctor",
        "character2": "fearmonger",
        "description": "If the Plague Doctor dies, a living Minion gains the Fearmonger ability in addition to their own ability, and learns this."
    },
    {
        "character1": "plague doctor",
        "character2": "goblin",
        "description": "If the Plague Doctor dies, a living Minion gains the Goblin ability in addition to their own ability, and learns this."
    },
    {
        "character1": "plague doctor",
        "character2": "marionette",
        "description": "If the Demon has a neighbor who is alive and a Townsfolk or Outsider when the Plague Doctor dies, that player becomes an evil Marionette. If there is already an extra evil player, this does not happen."
    },
    {
        "character1": "plague doctor",
        "character2": "scarlet woman",
        "description": "If the Plague Doctor dies, a living Minion gains the Scarlet Woman ability in addition to their own ability, and learns this."
    },
    {
        "character1": "plague doctor",
        "character2": "spy",
        "description": "If the Plague Doctor dies, a living Minion gains the Spy ability in addition to their own ability, and learns this."
    },
    {
        "character1": "plague doctor",
        "character2": "wraith",
        "description": "If the Plague Doctor dies, a living Minion gains the Wraith ability in addition to their own ability, and learns this."
    },
    {
        "character1": "boffin",
        "character2": "cult leader",
        "description": "If the Demon has the Cult Leader ability, they can’t turn good due to this ability."
    },
    {
        "character1": "boffin",
        "character2": "drunk",
        "description": "If the Demon would have the Drunk ability, the Boffin chooses a Townsfolk player to have this ability instead."
    },
    {
        "character1": "boffin",
        "character2": "goon",
        "description": "If the Demon has the Goon ability, they can’t turn good due to this ability."
    },
    {
        "character1": "boffin",
        "character2": "ogre",
        "description": "The Demon cannot have the Ogre ability."
    },
    {
        "character1": "boffin",
        "character2": "politician",
        "description": "The Demon cannot have the Politician ability."
    },
    {
        "character1": "boffin",
        "character2": "village idiot",
        "description": "If there is a spare token, the Boffin can give the Demon the Village Idiot ability."
    },
    {
        "character1": "cerenovus",
        "character2": "goblin",
        "description": "The Cerenovus may choose to make a player mad that they are the Goblin."
    },
    {
        "character1": "marionette",
        "character2": "balloonist",
        "description": "If the Marionette thinks that they are the Balloonist, +1 Outsider might have been added."
    },
    {
        "character1": "marionette",
        "character2": "damsel",
        "description": "The Marionette does not learn that a Damsel is in play."
    },
    {
        "character1": "marionette",
        "character2": "huntsman",
        "description": "If the Marionette thinks that they are the Huntsman, the Damsel was added."
    },
    {
        "character1": "marionette",
        "character2": "lil' monsta",
        "description": "The Marionette neighbors a Minion, not the Demon. The Marionette is not woken to choose who takes the Lil' Monsta token, and does not learn they are the Marionette if they have the Lil' Monsta token."
    },
    {
        "character1": "marionette",
        "character2": "poppy grower",
        "description": "When the Poppy Grower dies, the Demon learns the Marionette but the Marionette learns nothing."
    },
    {
        "character1": "marionette",
        "character2": "snitch",
        "description": "The Marionette does not learn 3 not in-play characters. The Demon learns an extra 3 instead."
    },
    {
        "character1": "marionette",
        "character2": "wraith",
        "description": "The Wraith does not wake with the Marionette."
    },
    {
        "character1": "mastermind",
        "character2": "al-hadikhia",
        "description": "If the Al-Hadikhia dies by execution, and the Mastermind is alive, the Al-Hadikhia chooses 3 good players tonight: if all 3 choose to live, evil wins. Otherwise, good wins."
    },
    {
        "character1": "pit-hag",
        "character2": "cult leader",
        "description": "If the Pit-Hag turns an evil player into the Cult Leader, they can't turn good due to their own ability."
    },
    {
        "character1": "pit-hag",
        "character2": "damsel",
        "description": "If a Pit-Hag creates a Damsel, the Storyteller chooses which player it is."
    },
    {
        "character1": "pit-hag",
        "character2": "goon",
        "description": "If the Pit-Hag turns an evil player into the Goon, they can't turn good due to their own ability."
    },
    {
        "character1": "pit-hag",
        "character2": "ogre",
        "description": "If the Pit-Hag turns an evil player into the Ogre, they can't turn good due to their own ability."
    },
    {
        "character1": "pit-hag",
        "character2": "politician",
        "description": "If the Pit-Hag turns an evil player into the Politician, they can't turn good due to their own ability."
    },
    {
        "character1": "pit-hag",
        "character2": "village idiot",
        "description": "If there is a spare token, the Pit-Hag can create an extra Village Idiot. If so, the drunk Village Idiot might change."
    },
    {
        "character1": "scarlet woman",
        "character2": "al-hadikhia",
        "description": "If there are two living Al-Hadikhias, the Scarlet Woman Al-Hadikhia becomes the Scarlet Woman again."
    },
    {
        "character1": "scarlet woman",
        "character2": "fang gu",
        "description": "If the Fang Gu chooses an Outsider and dies, the Scarlet Woman does not become the Fang Gu."
    },
    {
        "character1": "spy",
        "character2": "damsel",
        "description": "If the Spy is (or has been) in play, the Damsel is poisoned."
    },
    {
        "character1": "spy",
        "character2": "ogre",
        "description": "The Spy registers as evil to the Ogre."
    },
    {
        "character1": "spy",
        "character2": "poppy grower",
        "description": "If the Poppy Grower is in play, the Spy does not see the Grimoire until the Poppy Grower dies."
    },
    {
        "character1": "summoner",
        "character2": "clockmaker",
        "description": "If the Summoner is in play, the Clockmaker does not receive their information until a Demon is created."
    },
    {
        "character1": "summoner",
        "character2": "courtier",
        "description": "If the Summoner is drunk on the 3rd night, the Summoner chooses which Demon, but the Storyteller chooses which player."
    },
    {
        "character1": "summoner",
        "character2": "engineer",
        "description": "If the Engineer removes a Summoner from play before that Summoner uses their ability, the Summoner uses their ability immediately."
    },
    {
        "character1": "summoner",
        "character2": "hatter",
        "description": "The Summoner cannot create an in-play Demon. If the Summoner creates a not-in-play Demon, deaths tonight are arbitrary."
    },
    {
        "character1": "summoner",
        "character2": "kazali",
        "description": "The Summoner cannot create an in-play Demon. If the Summoner creates a not-in-play Demon, deaths tonight are arbitrary."
    },
    {
        "character1": "summoner",
        "character2": "legion",
        "description": "If the Summoner creates Legion, most players (including all evil players) become evil Legion."
    },
    {
        "character1": "summoner",
        "character2": "lord of typhon",
        "description": "If the Summoner creates a Lord of Typhon, the Lord of Typhon must neighbor a Minion. The other neighbor becomes a not-in-play evil Minion."
    },
    {
        "character1": "summoner",
        "character2": "marionette",
        "description": "The Marionette neighbors the Summoner. The Summoner knows who the Marionette is."
    },
    {
        "character1": "summoner",
        "character2": "pit-hag",
        "description": "The Summoner cannot create an in-play Demon. If the Summoner creates a not-in-play Demon, deaths tonight are arbitrary."
    },
    {
        "character1": "summoner",
        "character2": "poppy grower",
        "description": "If the Poppy Grower is alive when the Summoner acts, the Summoner chooses which Demon, but the Storyteller chooses which player."
    },
    {
        "character1": "summoner",
        "character2": "preacher",
        "description": "If the Preacher chose the Summoner on or before the 3rd night, the Summoner chooses which Demon, but the Storyteller chooses which player."
    },
    {
        "character1": "summoner",
        "character2": "pukka",
        "description": "The Summoner may choose a player to become the Pukka on the 2nd night."
    },
    {
        "character1": "summoner",
        "character2": "zombuul",
        "description": "If the Summoner turns a dead player into the Zombuul, the Storyteller treats that player as a Zombuul that has died once."
    },
    {
        "character1": "vizier",
        "character2": "alsaahir",
        "description": "If the Vizier is in play, the Alsaahir must also guess which Demon(s) are in play."
    },
    {
        "character1": "vizier",
        "character2": "courtier",
        "description": "If the Vizier loses their ability, they learn this. If the Vizier is executed while they have their ability, their team wins."
    },
    {
        "character1": "vizier",
        "character2": "fearmonger",
        "description": "The Vizier wakes with the Fearmonger, learns who they choose and cannot choose to immediately execute that player."
    },
    {
        "character1": "vizier",
        "character2": "investigator",
        "description": "If the Investigator learns that the Vizier is in play, the existence of the Vizier is not announced by the Storyteller."
    },
    {
        "character1": "vizier",
        "character2": "politician",
        "description": "The Politician might register as evil to the Vizier."
    },
    {
        "character1": "vizier",
        "character2": "preacher",
        "description": "If the Vizier loses their ability, they learn this. If the Vizier is executed while they have their ability, their team wins."
    },
    {
        "character1": "vizier",
        "character2": "zealot",
        "description": "The Zealot might register as evil to the Vizier."
    },
    {
        "character1": "widow",
        "character2": "damsel",
        "description": "If the Widow is (or has been) in play, the Damsel is poisoned."
    },
    {
        "character1": "widow",
        "character2": "poppy grower",
        "description": "If the Poppy Grower is in play, the Widow does not see the Grimoire until the Poppy Grower dies."
    },
    {
        "character1": "al-hadikhia",
        "character2": "princess",
        "description": "If the Princess nominated & executed a player on their 1st day, no one dies to the Al-Hadikhia ability tonight."
    },
    {
        "character1": "kazali",
        "character2": "choirboy",
        "description": "The Kazali can not choose the King to become a Minion if a Choirboy is in play."
    },
    {
        "character1": "kazali",
        "character2": "goon",
        "description": "The Kazali can choose that the Goon player is one of their evil Minions."
    },
    {
        "character1": "kazali",
        "character2": "huntsman",
        "description": "If the Kazali chooses the Damsel to become a Minion, and a Huntsman is in play, a good player becomes the Damsel."
    },
    {
        "character1": "kazali",
        "character2": "marionette",
        "description": "If the Kazali chooses to create a Marionette, they must choose one of their neighbors."
    },
    {
        "character1": "kazali",
        "character2": "soldier",
        "description": "The Kazali can choose that the Soldier player is one of their evil Minions."
    },
    {
        "character1": "legion",
        "character2": "engineer",
        "description": "Legion and the Engineer can not both be in play at the start of the game. If the Engineer creates Legion, most players (including all evil players) become evil Legion."
    },
    {
        "character1": "legion",
        "character2": "hatter",
        "description": "If the Hatter dies and Legion is in play, nothing happens. If the Hatter dies and an evil player chooses Legion, all current evil players become Legion."
    },
    {
        "character1": "legion",
        "character2": "minstrel",
        "description": "If Legion died by execution today, Legion keeps their ability, but the Minstrel might learn they are Legion."
    },
    {
        "character1": "legion",
        "character2": "preacher",
        "description": "If the Preacher chooses Legion, Legion keeps their ability, but the Preacher might learn they are Legion."
    },
    {
        "character1": "legion",
        "character2": "zealot",
        "description": "The Zealot might register as evil to Legion's ability."
    },
    {
        "character1": "leviathan",
        "character2": "banshee",
        "description": "Each night*, the Leviathan chooses an alive good player (different to previous nights): a chosen Banshee dies & gains their ability."
    },
    {
        "character1": "leviathan",
        "character2": "exorcist",
        "description": "Evil does not win when more than 1 good player has been executed, if the Exorcist is alive and has ever successfully chosen the Leviathan."
    },
    {
        "character1": "leviathan",
        "character2": "farmer",
        "description": "Each night*, the Leviathan chooses an alive good player (different to previous nights): a chosen Farmer uses their ability but does not die."
    },
    {
        "character1": "leviathan",
        "character2": "grandmother",
        "description": "If Leviathan is in play and the Grandchild dies by execution, evil wins."
    },
    {
        "character1": "leviathan",
        "character2": "hatter",
        "description": "If the Hatter dies on or after day 5, the Demon cannot choose Leviathan."
    },
    {
        "character1": "leviathan",
        "character2": "innkeeper",
        "description": "If the Leviathan is in play, the Innkeeper-protected-players are safe from all evil abilities."
    },
    {
        "character1": "leviathan",
        "character2": "king",
        "description": "If the Leviathan is in play, and at least 1 player is dead, the King learns an alive character each night."
    },
    {
        "character1": "leviathan",
        "character2": "mayor",
        "description": "If the Leviathan is in play & no execution occurs on day 5, good wins."
    },
    {
        "character1": "leviathan",
        "character2": "monk",
        "description": "If the Leviathan is in play, the Monk-protected-player is safe from all evil abilities."
    },
    {
        "character1": "leviathan",
        "character2": "pit-hag",
        "description": "After day 5, the Pit-Hag cannot choose Leviathan."
    },
    {
        "character1": "leviathan",
        "character2": "ravenkeeper",
        "description": "Each night*, the Leviathan chooses an alive player (different to previous nights): a chosen Ravenkeeper uses their ability but does not die."
    },
    {
        "character1": "leviathan",
        "character2": "sage",
        "description": "Each night*, the Leviathan chooses an alive good player (different to previous nights): a chosen Sage uses their ability but does not die."
    },
    {
        "character1": "leviathan",
        "character2": "soldier",
        "description": "If the Leviathan is in play, the Soldier is safe from all evil abilities."
    },
    {
        "character1": "lil' monsta",
        "character2": "hatter",
        "description": "If a Demon chooses Lil' Monsta, they also choose a Minion to become and babysit Lil' Monsta tonight."
    },
    {
        "character1": "lil' monsta",
        "character2": "poppy grower",
        "description": "If the Poppy Grower is in play, Minions don't wake together. They are woken one by one, until one of them chooses to take the Lil' Monsta token."
    },
    {
        "character1": "lil' monsta",
        "character2": "scarlet woman",
        "description": "If there are 5 or more players alive and the player holding the Lil' Monsta token dies, the Scarlet Woman is given the Lil' Monsta token tonight."
    },
    {
        "character1": "lil' monsta",
        "character2": "vizier",
        "description": "The Vizier can die by execution if they are babysitting Lil' Monsta."
    },
    {
        "character1": "lleech",
        "character2": "mastermind",
        "description": "If the Mastermind is alive and the Lleech's host dies by execution, the Lleech lives but loses their ability."
    },
    {
        "character1": "lleech",
        "character2": "slayer",
        "description": "If the Slayer slays the Lleech's host, the host dies."
    },
    {
        "character1": "riot",
        "character2": "banshee",
        "description": "Each night*, Riot chooses an alive good player (different to previous nights): a chosen Banshee dies & gains their ability."
    },
    {
        "character1": "riot",
        "character2": "exorcist",
        "description": "If the Exorcist chooses Riot on the 3rd night, Minions do not become Riot."
    },
    {
        "character1": "riot",
        "character2": "farmer",
        "description": "Each night*, Riot chooses an alive good player (different to previous nights): a chosen Farmer uses their ability but does not die."
    },
    {
        "character1": "riot",
        "character2": "grandmother",
        "description": "If Riot is in play and the Grandchild dies during the day, the Grandmother dies too."
    },
    {
        "character1": "riot",
        "character2": "innkeeper",
        "description": "If Riot is in play, the Innkeeper-protected player is safe from all evil abilities."
    },
    {
        "character1": "riot",
        "character2": "king",
        "description": "If Riot is in play, and at least 1 player is dead, the King learns an alive character each night."
    },
    {
        "character1": "riot",
        "character2": "mayor",
        "description": "The Mayor may choose to stop nominations. If they do so when only 1 Riot is alive, good wins. Otherwise, evil wins."
    },
    {
        "character1": "riot",
        "character2": "monk",
        "description": "If Riot is in play, the Monk-protected player is safe from all evil abilities."
    },
    {
        "character1": "riot",
        "character2": "ravenkeeper",
        "description": "Each night*, Riot chooses an alive good player (different to previous nights): a chosen Ravenkeeper uses their ability but does not die."
    },
    {
        "character1": "riot",
        "character2": "sage",
        "description": "Each night*, Riot chooses an alive good player (different to previous nights): a chosen Sage uses their ability but does not die."
    },
    {
        "character1": "riot",
        "character2": "soldier",
        "description": "If Riot is in play, the Soldier is safe from all evil abilities."
    },
    {
        "character1": "vortox",
        "character2": "banshee",
        "description": "If the Vortox is in play and the Demon kills the Banshee, the players still learn that the Banshee has died."
    },
    {
        "character1": "yaggababble",
        "character2": "exorcist",
        "description": "If the Exorcist chooses the Yaggababble, the Yaggababble ability does not kill tonight."
    }
]