[
  {
    "id": "blademaster",
    "type": "townsfolk",
    "name": "Espadachim",
    "ability": "Você começa sabendo um personagem Lacaio em jogo. Se você adivinhar publicamente quem é durante o dia (uma chance), ele morre."
  },
  {
    "id": "guide",
    "type": "townsfolk",
    "name": "Guia",
    "ability": "A cada noite, escolha de 1 a 3 jogadores: você fica sabendo se qualquer algum deles foi escolhido ou afetado por habilidades do mal esta noite."
  },
  {
    "id": "broker",
    "type": "townsfolk",
    "name": "Corretor",
    "ability": "A cada noite, escolha 2 jogadores vivos: se eles forem do mesmo alinhamento, habilidades direcionadas a um serão redirecionadas para o outro esta noite."
  },
  {
    "id": "geomancer",
    "type": "townsfolk",
    "name": "Geomante",
    "ability": "A cada noite, você fica sabendo o próximo tipo de personagem no sentido horário do jogador que você aprendeu ontem. (Viajantes não contam.)"
  },
  {
    "id": "prefect",
    "type": "townsfolk",
    "name": "Monitor",
    "ability": "A cada noite*, saiba se um não-Cidadão (& não-Viajante) morreu hoje de dia ou de noite."
  },
  {
    "id": "historian",
    "type": "townsfolk",
    "name": "Historiador",
    "ability": "A cada noite*, se um jogador morreu hoje de dia, saiba o número de Cidadãos vivos."
  },
  {
    "id": "cleric",
    "type": "townsfolk",
    "name": "Clérigo",
    "ability": "A cada noite*, escolha um jogador: se você escolher o Demônio, você morre & ele fica bêbado até o amanhecer."
  },
  {
    "id": "patrol",
    "type": "townsfolk",
    "name": "Patrulha",
    "ability": "A cada noite*, escolhe 2 personagens do bem (diferentes da noite anterior): se ambos estão vivos, eles não podem morrer esta noite."
  },
  {
    "id": "tabby",
    "type": "townsfolk",
    "name": "Malhado",
    "ability": "A cada noite*, escolha um jogador (exceto você ou Viajantes): se ele é um personagem do bem & morrer devido à habilidades do mal hoje a noite, vocês trocam de personagens."
  },
  {
    "id": "envoy",
    "type": "townsfolk",
    "name": "Enviado",
    "ability": "A cada dia, anuncie publicamente um personagem: esta noite, você fica sabendo se ele está em jogo. Se você receber um 'não', você então perde esta habilidade."
  },
  {
    "id": "zhen_br",
    "type": "townsfolk",
    "name": "Zhen",
    "ability": "Uma vez por jogo, à noite*, escolhe um personagem Cidadão: se ele estiver em jogo, ele fica bêbado e morre."
  },
  {
    "id": "consort",
    "type": "townsfolk",
    "name": "Consorte Real",
    "ability": "Uma vez por jogo, o Narrador irá quebrar as regras do jogo para você. Você privadamente fica sabendo o que foi feito."
  },
  {
    "id": "thaumaturge",
    "type": "townsfolk",
    "name": "Taumaturgo",
    "ability": "Na sua 1ª noite, escolha um número. Na noite daquele número, saiba aquele número de personagens em jogo."
  },
  {
    "id": "puppeteer",
    "type": "townsfolk",
    "name": "Mestre dos Bonecos",
    "ability": "Se você morrer à noite, você troca de personagens com um Lacaio vivo."
  },
  {
    "id": "dyer",
    "type": "townsfolk",
    "name": "Tintureiro",
    "ability": "Se você morrer à noite, a habilidade do Demônio se torna: 'A cada noite*, um jogador pode morrer'."
  },
  {
    "id": "brushholder",
    "type": "townsfolk",
    "name": "Porta-Pincel",
    "ability": "Se você morrer de dia, você fica sabendo um jogador do bem hoje à noite. Se você morrer à noite, você fica sabendo um jogador do mal."
  },
  {
    "id": "tombsculptor",
    "type": "townsfolk",
    "name": "Escultor de Túmulos",
    "ability": "Se nenhum jogador do mal estiver morto, você só pode morrer por execução."
  },
  {
    "id": "prosecutor",
    "type": "townsfolk",
    "name": "Promotor",
    "ability": "Após a sua primeira nomeação, à noite, saiba o personagem do jogador nomeado. Demônios registram como personagens do bem para você."
  },
  {
    "id": "bookboy",
    "type": "outsider",
    "name": "Menino dos Livros",
    "ability": "Na sua 1ª noite, escolha um jogador (exceto você). Quando uma habilidade do mal afetar ele, você morre naquela noite*."
  },
  {
    "id": "embalmer",
    "type": "outsider",
    "name": "Embalsamador",
    "ability": "Se 5 ou mais jogadores estiverem vivos e você nomear, executar e matar o Demônio, você se torna um Demônio do mal. (Viajantes não contam)"
  },
  {
    "id": "server",
    "type": "outsider",
    "name": "Atendente",
    "ability": "Um de seus vizinhos do bem está bêbado, mesmo que você esteja morto."
  },
  {
    "id": "vintner",
    "type": "minion",
    "name": "Vinicultor",
    "ability": "A cada noite, escolha um personagem Cidadão: você escolhe a próxima informação que esse personagem receberá."
  },
  {
    "id": "gudiao_br",
    "type": "minion",
    "name": "Gu Diao",
    "ability": "A cada noite, escolha um vizinho vivo do bem: você fica sabendo o personagem dele, ele está envenenado & registra como um Gu Diao do mal até o anoitecer."
  },
  {
    "id": "mengpo_br",
    "type": "minion",
    "name": "Meng Po",
    "ability": "A cada noite*, escolha um jogador: se ele estiver vivo ao amanhecer, ele escolhe entre perder a sua habilidade ou morrer & manter sua habilidade até o anoitecer."
  },
  {
    "id": "huapi_br",
    "type": "minion",
    "name": "Huapi",
    "ability": "Na sua 1ª noite, escolha um jogador vivo: ele morre mas registra como vivo. Se ele morrer novamente, ele fica vivo & você ganha novamente esta habilidade."
  },
  {
    "id": "warden",
    "type": "demon",
    "name": "Carcereiro",
    "ability": "A cada noite, escolha até 3 jogadores. 1 jogador que você escolheu na noite passada morre: se qualquer um deles morreu hoje de dia, todos morrem hoje à noite."
  },
  {
    "id": "yan",
    "type": "demon",
    "name": "Yan",
    "ability": "A cada noite, escolha um jogador: ele morre amanhã à noite. Na sua 1ª noite, olhe o Grimório e escolha um jogador: ele morre na 3ª noite, mesmo que por alguma razão ele não possa morrer."
  },
  {
    "id": "conspirator",
    "type": "demon",
    "name": "Conspirador",
    "ability": "A cada noite*, escolha um jogador: ele morre. Se você não votou hoje, escolha mais um jogador: ele morre."
  },
  {
    "id": "tyrant",
    "type": "demon",
    "name": "Tirano",
    "ability": "A cada noite*, escolha de 0 a 2 jogadores: eles morrem. O número de jogadores escolhido não pode ser o mesmo que o número de mortes na noite anterior (máximo 2)."
  },
  {
    "id": "guhuo",
    "type": "demon",
    "name": "Guhuo",
    "ability": "A cada noite*, escolha um jogador: ele morre. Você pode ganhar a habilidade do Lacaio que morreu mais recentemente por execução."
  },
  {
    "id": "outlaw",
    "type": "traveller",
    "name": "Fora-da-Lei",
    "ability": "A cada noite*, um jogador que interrompeu você hoje pode ficar bêbado até o amanhecer, mesmo que você esteja morto."
  },
  {
    "id": "messenger_br",
    "type": "fabled",
    "name": "Mensageiro",
    "ability": "Habilidades de escolha não têm restrições."
  }
]